FV2504/E_0623.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.7.4: AD: Lieferbeginn</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0623</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Wurde der Anwendungsfall für eine verbrauchende Marktlokation oder ruhende Marktlokation verwendet?<BR align="left"/>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Wurde eine Anfrage zur Beendigung der Zuordnung gestellt?<BR align="left"/>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>30: </B>Hat der LFA fristgerecht geantwortet?<BR align="left"/>>];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>40: </B>Hat der LFA der Anfrage zur Beendigung der Zuordnung widersprochen?<BR align="left"/>Hinweis: Im Fall der Zustimmung ist dem LFA, dem die Anfrage zur Beendigung der Zuordnung zugestellt wurde in jedem Fall eine "Beendigung der Zuordnung des LFA zur Marktlokation bzw. Tranche" zuzusenden.<BR align="left"/>>];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>50: </B>Wurde in der Beantwortung der Anfrage zur Beendigung der Zuordnung der Code A30 „Ablehnung: Die Belieferung wurde zu dem angefragten Termin aus der Anfrage zur Beendigung der Zuordnung bereits beendet und eine Abmeldung von dem LFA bereits versendet, die durch den NB bereits bestätigt wurde.“ verwendet?<BR align="left"/>>];
    "A50" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A50</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Der LFA hat der Anfrage zur Beendigung der Zuordnung widersprochen.<BR align="left"/></FONT>>];
    "60" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>60: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A51" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A51</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/></FONT>>];
    "A99" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A99</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Sonstiges <BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.04.2026 00:00 Uhr<BR align="left"/></FONT>>];
    "400" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>400: </B>Handelt es sich um Geschäftsvorfall 3?<BR align="left"/>>];
    "410" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>410: </B>Wurde eine Anfrage zur Beendigung der Zuordnung gestellt?<BR align="left"/>>];
    "420" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>420: </B>Hat der LFA fristgerecht geantwortet?<BR align="left"/>>];
    "430" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>430: </B>Hat der LFA der Anfrage zur Beendigung der Zuordnung widersprochen?<BR align="left"/>Hinweis: Im Fall der Zustimmung ist dem LFA, dem die Anfrage zur Beendigung der Zuordnung zugestellt wurde in jedem Fall eine "Beendigung der Zuordnung des LFA zur Marktlokation bzw. Tranche" zuzusenden.<BR align="left"/>>];
    "440" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>440: </B>Wurde in der Beantwortung der Anfrage zur Beendigung der Zuordnung der Code A41 „Ablehnung: Die Belieferung wurde zu dem angefragten Termin aus der Anfrage zur Beendigung der Zuordnung bereits beendet und eine Abmeldung von dem LFA bereits versendet, die durch den NB bereits bestätigt wurde.“ verwendet?<BR align="left"/>>];
    "A57" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A57</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Der LFA hat der Anfrage zur Beendigung der Zuordnung widersprochen.<BR align="left"/></FONT>>];
    "500" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>500: </B>Wurden Anfragen zur Beendigung der Zuordnung an die zugeordneten Lieferanten der Tranchen, an der Marktlokation gestellt?<BR align="left"/>>];
    "510" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>510: </B>Wurde mindestens einer Anfrage zur Beendigung der Zuordnung zugestimmt?<BR align="left"/>>];
    "A53" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A53</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Der gewünschte Prozentsatz an der Marktlokation ist nicht frei<BR align="left"/></FONT>>];
    "520" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>520: </B>Ist ein ausreichend großer Prozentsatz an der Marktlokation frei geworden?<BR align="left"/>>];
    "A54" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A54</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Der gewünschte Prozentsatz an der Marktlokation ist nicht frei<BR align="left"/></FONT>>];
    "530" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>530: </B>Verbleibt ein Anteil im Bilanzkreis des Netzbetreibers?<BR align="left"/>>];
    "540" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>540: </B>Handelt es sich um eine direktvermarktungspflichtige Marktlokation?<BR align="left"/>>];
    "A55" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A55</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Unter Bildung einer neuen Tranche sowie Info über fehlende Anteile an der Marktlokation in der Bilanzierung<BR align="left"/>Hinweis: Trigger für Prozess: Herstellung einer 100% LF-Zuordnung zu einer Marktlokation beim NB<BR align="left"/></FONT>>];
    "600" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>600: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A56" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A56</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Unter Bildung einer neuen Tranche<BR align="left"/></FONT>>];

    "Start" -> "10";
    "10" -> "20" [label="Ja"];
    "10" -> "400" [label="Nein"];
    "20" -> "60" [label="Nein"];
    "20" -> "30" [label="Ja"];
    "30" -> "40" [label="Ja"];
    "30" -> "60" [label="Nein"];
    "40" -> "50" [label="Ja"];
    "40" -> "60" [label="Nein"];
    "50" -> "A50" [label="Nein"];
    "50" -> "60" [label="Ja"];
    "60" -> "A51" [label="Nein"];
    "60" -> "A99" [label="Ja"];
    "400" -> "500" [label="Ja"];
    "400" -> "410" [label="Nein"];
    "410" -> "420" [label="Ja"];
    "410" -> "600" [label="Nein"];
    "420" -> "430" [label="Ja"];
    "420" -> "600" [label="Nein"];
    "430" -> "440" [label="Ja"];
    "430" -> "500" [label="Nein"];
    "440" -> "A57" [label="Nein"];
    "440" -> "500" [label="Ja"];
    "500" -> "510" [label="Ja"];
    "500" -> "600" [label="Nein"];
    "510" -> "520" [label="Ja"];
    "510" -> "A53" [label="Nein"];
    "520" -> "530" [label="Ja"];
    "520" -> "A54" [label="Nein"];
    "530" -> "540" [label="Ja"];
    "530" -> "600" [label="Nein"];
    "540" -> "A55" [label="Ja"];
    "540" -> "600" [label="Nein"];
    "600" -> "A56" [label="Nein"];
    "600" -> "A99" [label="Ja"];

    bgcolor="transparent";
}
